recipes/pizza-dough.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Pizza Dough</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="james" />
<link rel="stylesheet" type="text/css" href="../static/recipe.css" />
<link rel="icon" type="image/ico" href="../static/favicon.svg" />
</head>
<body>
<div id="org-div-home-and-up"> <a href="../index.html"> Home </a> </div> <div id="btns"><button id="copy-btn" onclick="copyTicked()"></button> <button id="untick-btn" onclick="untickAll()"></button></div><div id="notify">Copied!</div><div id="content">
<h1 class="title">Pizza Dough</h1>
<p>
<a href="https://www.mom4real.com/homemade-pizza-dough-recipe/">Original link</a>
</p>

<div id="outline-container-org41d9fab" class="outline-2">
<h2 id="org41d9fab">Ingredients</h2>
<div class="outline-text-2" id="text-org41d9fab">
<ul class="org-ul">
<li>3.5 Cups Bread or All-Purpose Flour</li>
<li>1 Teaspoon Sugar</li>
<li>1 Envelope Instant Dry Yeast</li>
<li>2 Teaspoons Kosher Salt</li>
<li>1.5 Cups Warm Water</li>
<li>2 Tablespoons Olive Oil</li>
</ul>
</div>
</div>

<div id="outline-container-orgf3c1cbf" class="outline-2">
<h2 id="orgf3c1cbf">Method</h2>
<div class="outline-text-2" id="text-orgf3c1cbf">
<ol class="org-ol">
<li>Mix together flour, sugar, dry yeast and kosher salt. Slowly add water and olive oil. Mix together until dough forms into a ball. If the dough is too sticky, add a tablespoon of flour until it forms a ball. If the dough is too dry, add a tablespoon of warm water until it forms a ball. Once your dough is formed, knead into a smooth firm ball on a floured surface.</li>
<li>Grease a large bowl with olive oil and place your dough in the bowl. Cover with plastic wrap, and let sit for at least an hour.</li>
<li>The dough will double in size. Now flour your surface and cut the dough in half. Place a damp cloth over the dough and allow it to sit for 10 minutes. Now it's time to roll your dough out into whatever shape you like, while gently pulling the dough to stretch it.</li>
</ol>
</div>
</div>
</div>
</body>
</html>
